[
  {
    "type": "announcement",
    "title": "SAVE THESE 2025-2026 DATES",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "SATURDAY COFFEE resumes this Saturday, November 15th at 9:00am.\n***PLEASE NOTE: $2.00 PER PERSON***\nPlease consider signing up to Host a Saturday Coffee.\n\nCHRISTMAS Decorating at the Pools, week of December 1st. Exact date: TBD\n\nLADIES LUNCHEON:\nTUESDAY, JANUARY 20th\n\nGARAGE SALE SET-UP:\nFRIDAY, JANUARY 23rd\n\nGARAGE SALE:\nSATURDAY, JANUARY 24th\n\nVALENTINE'S PIZZA PARTY:\nFRIDAY, FEBRUARY 13th\n\nANNUAL MEETING:\nSATURDAY, FEBRUARY 21st\n\nLAST HURRAH DINNER DANCE:\nSUNDAY, MARCH 15th\n\nWATCH THE BULLETIN BOARDS FOR ADDITIONAL INFORMATION, SIGN-UP SHEETS AND EVENTS!\nWE WOULD APPRECIATE HAVING ADDITIONAL HELP ON THE SOCIAL COMMITTEE.\nIF YOU ARE INTERESTED IN JOINING THE COMMITTEE OR ASSISTING WITH THE GARAGE SALE OR OTHER EVENTS,\nPLEASE GET IN TOUCH WITH PAT JAMISON 406-600-8661 E-103 or MARSHA BOSAK 810-333-2871 K-103"
  },
  {
    "type": "announcement",
    "title": "BOOK GROUP",
    "meta": "Posted: December 20, 2025 • Location: POOL 2",
    "text": "Welcome to Book Group 2026\n\nOur first meeting is on Tuesday, January 13th at Pool 2 - 9:30am\n\nWe will be discussing:\n- The Last Child by John Hart\n- Three Days in June by Anne Tyler"
  },
  {
    "type": "announcement",
    "title": "ANNUAL GARAGE SALE!",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "SATURDAY, JANUARY 24, 2026 7:30 AM - 1:30 PM\n\nOUR ANNUAL GARAGE SALE IS APPROACHING. PLEASE SAVE ANY ITEMS YOU WOULD LIKE TO DONATE TO THE GARAGE SALE. MARK YOUR ITEMS AS BEST YOU CAN. HOWEVER, DO NOT MARK PUZZLES, BOOKS, SHOES, AND CLOTHES.\n\nTHERE IS NO STORAGE AVAILABLE IN THE SHEDS SO PLEASE KEEP ITEMS IN YOUR CONDO UNTIL SET-UP ON FRIDAY, JANUARY 23, 2026.\n\nMORE DETAILS TO FOLLOW.\n\nTHANKS SO MUCH."
  },
  {
    "type": "document",
    "title": "Access to Fountains V Information on Guardian Property Management's Website",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "For an overview of Guardian Property Management, select <a href=\\\"https://drive.google.com/file/d/1xOkBc7fpDEI-TkxLZs8VL0w12FDkdNtm/view\\\">Guardian Property Management Overview</a>\n\nTo access Fountains V Information on Guardian Property Management's Website:\nGo to <a href=\\\"https://gpm.cincwebaxis.com/\\\">Fountains V Information/Guardian Property Management</a>\n\nIf you haven't already registered on Guardian's website:\nOn the top right side of the page, select the REGISTER button and complete the required information.\nNOTE: Use your Fountains V address and leave Account Number blank.\n\nOnce Guardian has set up your account, they will send you a temporary password (which may take a few days). You will then be able to sign in and change your password.\n\nIf you have any questions about the registration process, please contact John Dean (309-310-5770) or Jan Cronstrom (508-517-5120)."
  },
  {
    "type": "document",
    "title": "Hurricane Preparation and Readiness",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "<a href=\\\"https://drive.google.com/file/d/1ZA9z4An1djMoaGKaqiIdlU8YwjVU6HOb/view\\\">Hurricane Preparation</a>\n<a href=\\\"https://drive.google.com/file/d/1SNgd3xFq1zwOhxT0fnVpAhPQ09fOiNUY/view\\\">Hurricane Readiness</a>"
  },
  {
    "type": "document",
    "title": "Fountains V Board of Directors (2026-27)",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "President - Dane Karnitz\nBuildings - Ron Lenzen\nGrounds - Frank Boquard\nSecretary - John Dean\nTreasurer - Jan Cronstrom"
  },
  {
    "type": "announcement",
    "title": "Update on Fiber Internet for our Fountains V Community",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "The board reviewed the Tillman Fiber design document and voted to approve the project at the meeting held on 10/21/25.\nTillman is preparing to begin the work in the next few weeks. The new system Go Live date is now estimated to be 01/01/2026."
  },
  {
    "type": "announcement",
    "title": "Are you looking for a condo watcher???",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "If you are looking for a condo watcher while you are away from our Fountains V Community, please contact Tom Dorway.\n\nTom’s contact information is:\nE-mail: tomdorway@gmail.com\nPhone: 239-571-3235"
  },
  {
    "type": "document",
    "title": "GARBAGE/TRASH, RECYCLE",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "Garbage/Trash:\nItems that cannot be disposed of in your kitchen disposal or household trash should be placed in the dumpster.\nFurniture, TVs, large items, or construction materials are prohibited in or around the dumpster.\nWhen the West dumpster is full, please use the East dumpster.\n\nThe Collier County Landfill (a.k.a. \\\"the dump\\\") for disposing of larger items is located at:\n3730 White Lake Blvd\nNaples, Florida\nMonday - Saturday 8:30 AM to 4:30 PM\n\nRecycling:\nRecyclables must be placed in the Recycle bins.\nPlease do not place garbage/trash, plastic bags, or any type of styrofoam in the Recycle bins.\nBoxes must be broken down before being placed in the Recycle bins. NOTE: We are charged if they are not broken down.\n\nThe Naples Recycling drop-off center for recycling larger items is located at:\n2640 Corporate Flight Dr.\nNaples, Florida\nMonday - Saturday 8:30 AM to 4:30 PM"
  },
  {
    "type": "document",
    "title": "PEST CONTROL",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "If anyone has a bug problem in their unit, please call Massey Pest Control at 239-430-0708 to schedule an in-home inspection.\nMassey needs 48 hours' advance notice, and Tuesday is Massey's scheduled day for the Fountains V association.\nNOTE: Fountains V has a contract with Massey Pest Control."
  },
  {
    "type": "document",
    "title": "BICYCLES",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "All bicycles that are not stored inside your unit need to be tagged and registered with Fountains V.\nThe cost for this is $5.00.\n\nFor more information, please call:\nPhil Froburg (978-502-3494)\nor\nJohn Dean (309-310-5770)"
  },
  {
    "type": "document",
    "title": "RECYCLE YOUR BICYCLE!",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "The 24 Hour Club is a place where 117 recovery meetings are held each week.\nThey consist of AA, Alanon, Alateen, and ACA meetings held in our 3 meeting rooms and outdoor patio.\nA decision was made by the Club that we would accept donations of used bicycles and give them free of charge to those in need.\nThese recipients are most often getting out of a rehab program and need the bikes for transportation.\nIt is very common for those in early recovery to have lost the ability to drive cars.\nThese bikes allow them to get jobs and attend recovery meetings.\n\nWhile we repair those bikes that need restoration through volunteer member labor, many of the bikes need little or no work.\nWe have also accepted modest cash donations to replace tires and parts for small repairs.\nWe are fortunate enough to have a large shed on our property for the storage and repair of bikes.\n\nWe would be pleased to come pick up bikes for distribution.\nThis program has been hugely successful. We have distributed 135 bikes so far!\nA couple of recipients have reported back that the bike they received changed their lives!\n\nIf you would like to discuss our program with us, or if you have a bike to donate, please contact:\nPeter Fleming\n239-877-7450\nPflemin2@gmail.com"
  },
  {
    "type": "announcement",
    "title": "Interested in renting February and/or March 2026",
    "meta": "Posted: December 20, 2025 • Location: Fountains V",
    "text": "Interested in renting February and/or March 2026.\nIn or near Fountains V is preferred.\nContact Sue Carlson at 920.973.8225."
  }
]
